[
  {
    "id": 1,
    "title": "What is CSS",
    "description": "CSS (Cascading Style Sheets) is a style sheet language used to describe the appearance and formatting of a document written in HTML or XML. \n\nCSS is essential for controlling the visual layout of web pages, enabling developers to separate content (HTML) from design (CSS). \n\nKey Features of CSS: \n\nStyling Elements: \nCSS controls the color, fonts, spacing, layout, and overall look of HTML elements. \n\nCascading: \nThe term 'cascading' means that multiple style sheets can be applied to the same HTML document. If multiple styles affect the same element, rules are applied in a priority order (from highest to lowest specificity). \n\nSelectors: \nCSS uses selectors to target HTML elements (e.g., by tag name, class, or ID) and apply specific styles. \n\nBox Model: \nCSS uses the box model concept, which includes margins, borders, padding, and the actual content area to define the layout of elements. \n\nResponsive Design: \nCSS helps create responsive web designs that adjust to different screen sizes (mobile, tablet, desktop).",
    "highlightWords": ["key features of css:","styling elements:","cascading:","selectors:","box model:","responsive design:"]
  },
  {
    "id": 2,
    "title": "Selectors",
    "description": [
      "CSS selectors are patterns used to select and style HTML elements. They define which elements on the page the CSS rules apply to. \nHere’s an overview of the different types of CSS selectors: \n\n1. Basic Selectors: \nElement Selector (Type Selector): Targets all instances of a specific HTML element.",
      "p { \n color: blue; \n}",
      "This applies to all <p> (paragraph) elements. \n\nID Selector: \nTargets a single unique element with a specific ID. IDs are unique and should only be used once per page.",
      "#header { \n background-color: grey; \n}",
      "This applies to the element with id='header'. \n\nClass Selector: \nTargets all elements with a specified class. Multiple elements can share the same class.",
      ".highlight { \n background-color: yellow; \n}",
      "This applies to all elements with class='highlight'. \n\n2. Attribute Selectors: \nTargets elements with specific attributes or attribute values",
      "input[type='text'] { \n border: 1px solid black; \n}",
      "This applies to <input> elements with the attribute type='text'. \nOther examples: [href], [name='email']. \n\n3. Combinator Selectors: \nDescendant Selector: \nTargets elements that are inside a specified parent element.",
      "div p { \n color: green; \n}",
      "This applies to all <p> elements that are descendants of a <div> element. \n\nChild Selector (>): Targets direct child elements of a specified parent.",
      "ul > li { \n list-style-type: none; \n}",
      "This applies to all direct child <li> elements of a <ul>. \n\nAdjacent Sibling Selector (+): Targets an element that is immediately after a specified element.",
      "h1 + p { \n font-size: 20px; \n}",
      "This applies to the first <p> element immediately following an <h1>. \n\nGeneral Sibling Selector (~): \nTargets all sibling elements after a specified element.",
      "h2 ~ p { \n color: purple; \n}",
      "This applies to all <p> elements after an <h2>, even if they are not directly adjacent. \n\n4. Pseudo-Class Selectors: \nTargets elements based on their state.",
      "a:hover { \n color: red; \n}",
      "This applies to <a> elements when the user hovers over them. \nOther examples: :first-child, :last-child, :nth-child(), :focus, :checked. \n\n5. Pseudo-Element Selectors: \nTargets specific parts of an element.",
      "p::first-line { \n font-weight: bold; \n}",
      "This applies styles to the first line of all paragraphs. \nOther examples: ::before, ::after, ::selection. \n\n6. Grouping Selector: \nMultiple selectors can be grouped together, applying the same styles to different elements.",
      "h1, h2, h3 { \n font-family: Arial, sans-serif; \n}",
      "This applies the same font to all <h1>, <h2>, and <h3> elements. \n\n7. Universal Selector (*): \nTargets all elements on the page.",
      "* { \n margin: 0; \n padding: 0; \n}",
      "This removes default margin and padding from all elements. \n\nExample: Combining Selectors",
      "ul.menu li.active a { \n color: red; \n}",
      "This targets <a> elements inside a <li> element with the class active, which is itself inside a <ul> element with the class menu. \nCSS selectors are a powerful way to precisely target and style elements in a webpage!"
    ],
    "indices": [1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25],
    "highlightWords": [
      "1. Basic Selectors:",
      "Element Selector (Type Selector):",
      "ID Selector:",
      "Class Selector:",
      "2. Attribute Selectors:",
      "3. Combinator Selectors:",
      "Descendant Selector:",
      "Child Selector (>):",
      "Adjacent Sibling Selector (+):",
      "General Sibling Selector (~):",
      "4. Pseudo-Class Selectors:",
      "Other examples:",
      "5. Pseudo-Element Selectors:",
      "Pseudo-Element Selectors:",
      "6. Grouping Selector:",
      "7. Universal Selector (*):",
      "Example: Combining Selectors"
    ]
  }
]
